app/controllers/site_controller.rb

  def index

    if ((!current_user.nil?))

      @turnos_user = Turno.find_by_id_user(current_user.id)
      @turnos_all = Turno.all
---
SELECT  "turnos".* FROM "turnos" WHERE "turnos"."id_user" = ? LIMIT 1  [["id_user", 1]]
SELECT "turnos".* FROM "turnos"