app/controllers/turnos_controller.rb

  def index
    @turnos = Turno.all
---
SELECT "turnos".* FROM "turnos"

  def create
    @turno = Turno.new(turno_params)

    respond_to do |format|
      if @turno.save
---
INSERT INTO "turnos" ("id_paciente", "hora", "dia", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["id_paciente", 1], ["hora", "19:00"], ["dia", "01/01/2016"], ["created_at", "2016-01-08 14:03:28.633451"], ["updated_at", "2016-01-08 14:03:28.633451"]]

    def set_turno
      @turno = Turno.find(params[:id])
---
SELECT  "turnos".* FROM "turnos" WHERE "turnos"."id" = ? LIMIT 1  [["id", 1]]